# <font color=blue>Assignment for "Grouping and Aggregation Operations on DataFrames"</font>

For Pandas assignments, you are going to use [Titanic](https://www.kaggle.com/c/titanic/download/GQf0y8ebHO0C4JXscPPp%2Fversions%2FXkNkvXwqPPVG0Qt3MtQT%2Ffiles%2Ftrain.csv) (train.csv) dataset. Download the dataset and load to a data frame.

1. Calculate the average age of the passengers for each gender and passenger class by using `groupby()` method.

In [3]:
import pandas as pd
df=pd.read_csv("titanic.csv")
df2 = pd.DataFrame(df)
df2.groupby(by=["Sex","Pclass"]).agg({"Age" : [ "count"],  
                                       "Pclass" : ["count"] })

                Age Pclass
              count  count
Sex    Pclass
female 1         85     94
       2         74     76
       3        102    144
male   1        101    122
       2         99    108
       3        253    347

2. Group by embarkation port and print values. (Notice that you get unique values with this.)

In [11]:
df2.groupby(by="Embarked").agg({"Embarked" : [ "count"] })

         Embarked
            count
Embarked
C             168
Q              77
S             644